const config = require('../config')
const { cmd, commands } = require('../command');
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({
    pattern: "menu",
    alias: "allmenu",
    desc: "menu the bot",
    category: "menu2",
    react: "🌎",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `
╭━〔 *𝐁.𝐌.𝐁-𝐗𝐌𝐃* 〕━┈⊷
┃★╭──────────────
┃★│ Owner : *${config.OWNER_NAME}*
┃★│ Baileys : *Multi Device*
┃★│ Type : *NodeJs*
┃★│ Platform : *VPS*
┃★│ Mode : *[${config.MODE}]*
┃★│ Prifix : *[${config.PREFIX}]*
┃★│ Version : *1.0.0*
┃★╰──────────────
╰━━━━━━━━━━━━━━┈⊷
╭━━〔 *Download Menu* 〕┈⊷
┃🚘╭─────────────·๏
┃🚘┃★facebook
┃🚘┃★mediafire
┃🚘┃★tiktok
┃🚘┃★twitter
┃🚘┃★Insta
┃🚘┃★apk
┃🚘┃★img
┃🚘┃★tt2
┃🚘┃★git
┃🚘┃★spotify
┃🚘┃★play
┃🚘┃★play2
┃🚘┃★play3
┃🚘┃★audio
┃🚘┃★video
┃🚘┃★video2
┃🚘┃★ytmp3
┃🚘┃★ytmp4
┃🚘┃★song
┃🚘┃★darama
┃🚘┃★gdrive
┃🚘┃★smovie
┃🚘┃★baiscope 
┃🚘┃★ginisilia 
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Group Menu* 〕━┈⊷
┃🚘╭────────────·๏
┃🚘┃★grouplink
┃🚘┃★kickall
┃🚘┃★kickall2
┃🚘┃★kickall3
┃🚘┃★add
┃🚘┃★remove
┃🚘┃★kick
┃🚘┃★promote 
┃🚘┃★demote
┃🚘┃★dismiss 
┃🚘┃★revoke
┃🚘┃★setgoodbye
┃🚘┃★setwelcome
┃🚘┃★delete 
┃🚘┃★getpic
┃🚘┃★ginfo
┃🚘┃★delete 
┃🚘┃★disappear on
┃🚘┃★disappear off
┃🚘┃★disappear 7D,24H
┃🚘┃★allreq
┃🚘┃★updategname
┃🚘┃★updategdesc
┃🚘┃★joinrequests
┃🚘┃★senddm
┃🚘┃★nikal
┃🚘┃★mute
┃🚘┃★unmute
┃🚘┃★lockgc
┃🚘┃★unlockgc
┃🚘┃★invite
┃🚘┃★tag
┃🚘┃★hidetag
┃🚘┃★tagall
┃🚘┃★tagadmins
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Owner Menu* 〕━┈⊷
┃🚘╭────────────·๏
┃🚘┃★owner
┃🚘┃★menu
┃🚘┃★menu2
┃🚘┃★vv
┃🚘┃★listcmd
┃🚘┃★allmenu
┃🚘┃★repo
┃🚘┃★block
┃🚘┃★unblock
┃🚘┃★fullpp
┃🚘┃★setpp
┃🚘┃★restart
┃🚘┃★shutdown
┃🚘┃★updatecmd
┃🚘┃★alive
┃🚘┃★ping 
┃🚘┃★gjid
┃🚘┃★jid
┃🚘┃★sc
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Fun Menu* 〕━━┈⊷
┃🚘╭────────────·๏
┃🚘┃★insult
┃🚘┃★hack
┃🚘┃★ship
┃🚘┃★character
┃🚘┃★pickup 
┃🚘┃★joke
┃🚘┃★hrt
┃🚘┃★hpy
┃🚘┃★syd
┃🚘┃★anger
┃🚘┃★shy
┃🚘┃★kiss
┃🚘┃★mon
┃🚘┃★cunfuzed
┃🚘┃★setpp
┃🚘┃★hand
┃🚘┃★nikal
┃🚘┃★hold
┃🚘┃★hug
┃🚘┃★nikal
┃🚘┃★hifi
┃🚘┃★poke
┃🚘└───────────┈⊷
╰──────────────┈⊷
╭━━〔 *Convert Menu* 〕━┈⊷
┃🚘╭─────────────·๏
┃🚘┃★sticker
┃🚘┃★sticker2
┃🚘┃★fancy
┃🚘┃★take
┃🚘┃★tomp3
┃🚘┃★tts
┃🚘┃★trt
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Ai Menu* 〕━━┈⊷
┃🚘╭────────────·๏
┃🚘┃★ai
┃🚘┃★gpt
┃🚘┃★meta
┃🚘┃★blackbox
┃🚘┃★gpt4
┃🚘┃★bing
┃🚘┃★copilot
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Main Menu* 〕━━┈⊷
┃🚘╭─────────────·๏
┃🚘┃★ping
┃🚘┃★ping2
┃🚘┃★speed
┃🚘┃★live 
┃🚘┃★alive
┃🚘┃★runtime
┃🚘┃★uptime 
┃🚘┃★repo
┃🚘┃★owner
┃🚘┃★menu
┃🚘┃★menu2
┃🚘┃★restart
┃🚘└───────────┈⊷
╰──────────────┈⊷
╭━━〔 *Main Menu* 〕━━┈⊷
┃🚘╭─────────────·๏
┃🚘┃ setprefix
┃🚘┃★ mode
┃🚘┃★ auto_typing
┃🚘┃★ always_online
┃🚘┃★ auto_reacording
┃🚘┃★ status_view
┃🚘┃★ status_react
┃🚘┃★ read_message
┃🚘┃★ anti_bad
┃🚘┃★ auto_sticker
┃🚘┃★ auto_reply
┃🚘┃★ auto_voice
┃🚘┃★ auto_react
┃🚘┃★ custom_reacts
┃🚘┃★ anti_link
┃🚘┃★ status_reply
┃🚘└───────────┈⊷
╰──────────────┈⊷
╭━━〔 *Main Menu* 〕━━┈⊷
┃🚘╭─────────────·๏
┃🚘┃★bmbxmd
┃🚘┃★xmdbmb
┃🚘┃★support 
┃🚘┃★online 
┃🚘┃★family 
┃🚘┃★news
┃🚘┃★env
┃🚘┃★creator
┃🚘┃★owner
┃🚘┃★menu
┃🚘┃★menu2
┃🚘┃★restart
┃🚘└───────────┈⊷
╰──────────────┈⊷
╭━━〔 *Anime Menu* 〕━━┈⊷
┃🚘╭─────────────·๏
┃🚘┃★fack
┃🚘┃★dog
┃🚘┃★awoo
┃🚘┃★garl
┃🚘┃★waifu
┃🚘┃★neko
┃🚘┃★megnumin
┃🚘┃★neko
┃🚘┃★maid
┃🚘┃★loli
┃🚘┃★animegirl
┃🚘┃★animegirl
┃🚘┃★animegirl1
┃🚘┃★animegirl2
┃🚘┃★animegirl3
┃🚘┃★animegirl4
┃🚘┃★animegirl5
┃🚘┃★anime1
┃🚘┃★anime1
┃🚘┃★anime2
┃🚘┃★anime3
┃🚘┃★anime4
┃🚘┃★anime5
┃🚘┃★animenews
┃🚘┃★foxgirl
┃🚘┃★naruto
┃🚘└───────────┈⊷
╰─────────────┈⊷
╭━━〔 *Other Menu* 〕━┈⊷
┃🚘╭────────────·๏
┃🚘┃★fact
┃🚘┃★pair
┃🚘┃★pair2
┃🚘┃★fancy
┃🚘┃★logo <text>
┃🚘┃★define
┃🚘┃★news
┃🚘┃★movie
┃🚘┃★weather
┃🚘┃★srepo
┃🚘┃★insult
┃🚘┃★save
┃🚘┃★wikipedia
┃🚘┃★gpass
┃🚘┃★githubstalk
┃🚘┃★yts
┃🚘┃★ytv
┃🚘└───────────┈⊷
╰─────────────┈⊷
> ${config.DESCRIPTION}`;

        await conn.sendMessage(
            from,
            {
                image: { url: `https://github.com/bmb200/BMB-DATA/raw/refs/heads/main/image/menu2.jpg` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363382023564830@newsletter',
                        newsletterName: '🚀𝐁.𝐌.𝐁-𝐗𝐌𝐃🚀',
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/bmb200/BMB-DATA/raw/refs/heads/main/media/bmbsong.mp3' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`${e}`);
    }
});

    
